monName = [
  '0',
  'Slime', 'Surprised Slime', 'Angry Slime', 'Happy Slime', 'Expressionless Slime', 'Bat Goblin', 'Warrior Goblin', 'Thrower Goblin', 'Bomb Goblin', 'Ranger Goblin',
  '2-1', '2-2', '2-3', '2-4', '2-5', '2-6', '2-7', '2-8', '2-9', '2-0',
  '3-1', '3-2', '3-3', '3-4', '3-5', '3-6', '3-7', '3-8', '3-9', '3-0',
  '4-1', '4-2', '4-3', '4-4', '4-5', '4-6', '4-7', '4-8', '4-9', '4-0',
  '5-1', '5-2', '5-3', '5-4', '5-5', '5-6', '5-7', '5-8', '5-9', '5-0',
  '6-1', '6-2', '6-3', '6-4', '6-5', '6-6', '6-7', '6-8', '6-9', '6-0',
  '7-1', '7-2', '7-3', '7-4', '7-5', '7-6', '7-7', '7-8', '7-9', '7-0',
  '8-1', '8-2', '8-3', '8-4', '8-5', '8-6', '8-7', '8-8', '8-9', '8-0',
  '9-1', '9-2', '9-3', '9-4', '9-5', '9-6', '9-7', '9-8', '9-9', '9-0',
  '0-1', '0-2', '0-3', '0-4', '0-5', '0-6', '0-7', '0-8', '0-9', '0-0',
];
monNameKor = [
  '0',
  '슬라임', '놀란 슬라임', '화난 슬라임', '행복한 슬라임', '무표정 슬라임', '방망이 고블린', '전사 고블린', '투척 고블린', '폭탄 고블린', '레인저 고블린',
  '선인장', '서부의 선인장', '총잡이 선인장', '안경쓴 선인장', '대장 선인장', '사막 덤불', '가시 사막 덤불', '오아시스 덤불', '폭발성 덤불', '응축된 사막 덤불',
  '펭귄', '3-2', '3-3', '3-4', '3-5', '흉악한 북극곰', '3-7', '3-8', '3-9', '3-0',
  '꽃', '4-2', '4-3', '4-4', '4-5', '악어', '4-7', '4-8', '4-9', '4-0',
  '스켈레톤', '5-2', '5-3', '5-4', '던전 벽돌', '5-6', '5-7', '5-8', '5-9', '5-0',
  '6-1', '6-2', '6-3', '6-4', '괴생물체 A', '6-6', '6-7', '6-8', '6-9', '6-0',
  '7-1', '7-2', '7-3', '7-4', '7-5', '7-6', '7-7', '7-8', '7-9', '7-0',
  '8-1', '8-2', '8-3', '8-4', '8-5', '8-6', '8-7', '8-8', '8-9', '8-0',
  '9-1', '9-2', '9-3', '9-4', '9-5', '9-6', '9-7', '9-8', '9-9', '9-0',
  '0-1', '0-2', '0-3', '0-4', '0-5', '0-6', '0-7', '0-8', '0-9', '0-0',
];
monNameEng = [
  '0',
  'Slime', 'Surprised Slime', 'Angry Slime', 'Happy Slime', 'Expressionless Slime', 'Bat Goblin', 'Warrior Goblin', 'Thrower Goblin', 'Bomb Goblin', 'Ranger Goblin',
  '2-1', '2-2', '2-3', '2-4', '2-5', '2-6', '2-7', '2-8', '2-9', '2-0',
  '3-1', '3-2', '3-3', '3-4', '3-5', '3-6', '3-7', '3-8', '3-9', '3-0',
  '4-1', '4-2', '4-3', '4-4', '4-5', '4-6', '4-7', '4-8', '4-9', '4-0',
  '5-1', '5-2', '5-3', '5-4', '5-5', '5-6', '5-7', '5-8', '5-9', '5-0',
  '6-1', '6-2', '6-3', '6-4', '6-5', '6-6', '6-7', '6-8', '6-9', '6-0',
  '7-1', '7-2', '7-3', '7-4', '7-5', '7-6', '7-7', '7-8', '7-9', '7-0',
  '8-1', '8-2', '8-3', '8-4', '8-5', '8-6', '8-7', '8-8', '8-9', '8-0',
  '9-1', '9-2', '9-3', '9-4', '9-5', '9-6', '9-7', '9-8', '9-9', '9-0',
  '0-1', '0-2', '0-3', '0-4', '0-5', '0-6', '0-7', '0-8', '0-9', '0-0',
];
mobKilled = [
  '0',
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
];
lootName = [
  '0',
  'Slime Loot', 'Shiny Slime Loot', 'Goblin Loot', 'Shiny Goblin Loot',
  '2-1', '2-2', '2-3', '2-4',
  '3-1', '3-2', '3-3', '3-4',
  '4-1', '4-2', '4-3', '4-4',
  '5-1', '5-2', '5-3', '5-4',
  '6-1', '6-2', '6-3', '6-4',
  '7-1', '7-2', '7-3', '7-4',
  '8-1', '8-2', '8-3', '8-4',
  '9-1', '9-2', '9-3', '9-4',
  '0-1', '0-2', '0-3', '0-4'
];
lootNameKor = [
  '0',
  '슬라임 가방', '반짝이는 슬라임 가방', '고블린 가방', '반짝이는 고블린 가방',
  '2-1', '2-2', '2-3', '2-4',
  '3-1', '3-2', '3-3', '3-4',
  '4-1', '4-2', '4-3', '4-4',
  '5-1', '5-2', '5-3', '5-4',
  '6-1', '6-2', '6-3', '6-4',
  '7-1', '7-2', '7-3', '7-4',
  '8-1', '8-2', '8-3', '8-4',
  '9-1', '9-2', '9-3', '9-4',
  '0-1', '0-2', '0-3', '0-4'
];
lootNameEng = [
  '0',
  'Slime Loot', 'Shiny Slime Loot', 'Goblin Loot', 'Shiny Goblin Loot',
  '2-1', '2-2', '2-3', '2-4',
  '3-1', '3-2', '3-3', '3-4',
  '4-1', '4-2', '4-3', '4-4',
  '5-1', '5-2', '5-3', '5-4',
  '6-1', '6-2', '6-3', '6-4',
  '7-1', '7-2', '7-3', '7-4',
  '8-1', '8-2', '8-3', '8-4',
  '9-1', '9-2', '9-3', '9-4',
  '0-1', '0-2', '0-3', '0-4'
];
lootQuantity = [
  '0',
  0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
];
weaponName = [
  '0',
  'Gel sword', 'Gel boomerang', 'Iron sword', 'Spiked bat', 'Emerald Sword',
  '2-1', '2-2', '2-3', '2-4', '2-5',
  '3-1', '3-2', '3-3', '3-4', '3-5',
  '4-1', '4-2', '4-3', '4-4', '4-5',
  '5-1', '5-2', '5-3', '5-4', '5-5',
  '6-1', '6-2', '6-3', '6-4', '6-5',
  '7-1', '7-2', '7-3', '7-4', '7-5',
  '8-1', '8-2', '8-3', '8-4', '8-5',
  '9-1', '9-2', '9-3', '9-4', '9-5',
  '0-1', '0-2', '0-3', '0-4', '0-5'
];
weaponNameKor = [
  '0',
  '젤 검', '젤 부메랑', '철 검', '가시 방망이', '에메랄드 검',
  '2-1', '2-2', '2-3', '2-4', '2-5',
  '3-1', '3-2', '3-3', '3-4', '3-5',
  '4-1', '4-2', '4-3', '4-4', '4-5',
  '5-1', '5-2', '5-3', '5-4', '5-5',
  '6-1', '6-2', '6-3', '6-4', '6-5',
  '7-1', '7-2', '7-3', '7-4', '7-5',
  '8-1', '8-2', '8-3', '8-4', '8-5',
  '9-1', '9-2', '9-3', '9-4', '9-5',
  '0-1', '0-2', '0-3', '0-4', '0-5'
];
weaponNameEng = [
  '0',
  'Gel sword', 'Gel boomerang', 'Iron sword', 'Spiked bat', 'Emerald Sword',
  '2-1', '2-2', '2-3', '2-4', '2-5',
  '3-1', '3-2', '3-3', '3-4', '3-5',
  '4-1', '4-2', '4-3', '4-4', '4-5',
  '5-1', '5-2', '5-3', '5-4', '5-5',
  '6-1', '6-2', '6-3', '6-4', '6-5',
  '7-1', '7-2', '7-3', '7-4', '7-5',
  '8-1', '8-2', '8-3', '8-4', '8-5',
  '9-1', '9-2', '9-3', '9-4', '9-5',
  '0-1', '0-2', '0-3', '0-4', '0-5'
];
weaponLevel = [
  '0',
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
];
standardNotation = [
  '', 'K', 'M', 'B', 'T', 'Qu', 'Qi', 'Sx', 'Sp', 'O', 'N',
];
standardNotation2 = [
  '', 'U', 'D', 'T', 'Qa', 'Qi', 'Sx', 'Sp', 'Oc', 'No'
];
standardNotation3 = [
  'Dc', 'Vg', 'Tg', 'Qag', 'Qig', 'Sxg', 'Spg', 'Ocg', 'Nog', 'Ce'
];
extraStatusTips = [
  'The maximum level of the weapon is +999!',
  'Rare-grade sword damage is low, but with experience bottle!',
  'The amount of experience required is x3.2 each time the level goes up.!',
  'There are 100 monsters!',
  '???'
];
extraStatusTipsKor = [
  '무기의 최대 레벨은 +999 입나다!',
  '희귀등급 검은 데미지는 낮지만 경험치 병이 딸려옵니다!',
  '필요 경험치량은 레벨이 오를때마다 3.2배씩 증가합니다!',
  '몬스터는 100마리가 있습니다!',
  '???'
];
extraStatusTipsEng = [
  'The maximum level of the weapon is +999!',
  'Rare-grade sword damage is low, but with experience bottle!',
  'The amount of experience required is x3.2 each time the level goes up.!',
  'There are 100 monsters!',
  '???'
];
varData = [
  'playerLevel', 'stageUnlocked', 'playerExp', 'playerExpNeed', 'token',
  'playerHitPS', 'collectedWeapon', 'weaponMastery', 'playerDmg', 'translateNum',
  'weaponLevel', 'lootQuantity', 'tokenUpgrade', 'tokenUpgradePrice', 'tokenUpgrade',
  'tokenUpgradePrice', 'mobKilled', 'brokeUniverse', 'masteryCompeleted', 'playerSP',
  'masteryBought'
];
resetData = {
  0: 0, 1: 0, 2: 0, 3: 10, 4: 0,
  5: 0, 6: 0, 7: 0, 8: 1, 9: 0,
  10: ['0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  11: ['0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  12: [0, 0, 0, 0, 0, 0, 0],
  13: [3, 5, 10, 50, 5, 10, 100],
  14: [0, 0, 0, 0, 0, 0, 0],
  15: [3, 5, 10, 50, 5, 10, 100],
  16: ['0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  17: 0,
  18: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  19: 0,
  20: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
};
popupMsg = [
  'Reached max stage!', 'Reach Level', 'to Open', 'Break The Universe to Open'
];
popupMsgKor = [
  '최대 단계 도달!', '', '레벨에 도달하여 해금', '우주를 파괴하여 해금'
];
popupMsgEng = [
  'Reached max stage!', 'Reach Level', 'to Open', 'Break The Universe to Open'
];
tokenUpgradeName = [
  'Damage Buff', 'Click Buff', 'EXP Buff', 'Monster EXP Buff', 'Token (Click)', 'Token (Timer)'
];
tokenUpgradeNameKor = [
  '공격력 버프', '클릭 버프', '경험치 버프', '몬스터 경험치 버프', '토큰 획득 (클릭)', '토큰 획득 (타이머)', '자동 클릭'
];
tokenUpgradeNameEng = [
  'Damage Buff', 'Click Buff', 'EXP Buff', 'Monster EXP Buff', 'Token (Click)', 'Token (Timer)', 'Auto Click'
];
tokenUpgrade = [
  0, 0, 0, 0, 0, 0, 0
];
tokenUpgradePrice = [
  3, 5, 10, 50, 5, 10, 100
];
tokenUpgradeCap = [
  9999, 4000, 99, 15, 99, 85, 9999
];
masteryCompeleted = [
  0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0
];
masteryBought = [
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0
];
masteryPrice = [
  12, 12, 15, 30,
  40, 42, 55, 70,
  9999, 9999, 9999, 9999
]
masteryInfo = [
  '',
  '',
  '',
  '',
  '',
  '',
  '',
  '',
  '',
  '',
  '',
  '',
];
masteryInfoKor = [
  '레벨에 비례한 추가 데미지',
  '몬스터를 잡을때 loot를 하나 더 얻을 확률',
  '모든 무기 레벨의 합산에 비례한 경험치 부스트',
  '현재 레벨에 비례한 얻는 토큰 양 부스트',
  '강력한 몬스터 등장(Loot x100)',
  '레어 등급의 검이 나올 확률 x2',
  '레벨에 비례한 타이머로 획득한 토큰 부스트',
  '자동클릭으로도 토큰 획득 가능',
  '',
  '',
  '',
  '',
];
masteryInfoEng = [
  'Additional damage based on level',
  'Chance to get another loot when defeating a monster',
  'Boost EXP gain based on the Sum of all weapon Levels',
  'Boost amount of tokens gained based on Level',
  'Powerful monster appears (Loot x100)',
  'Rare-class sword chance x2',
  'Token boost obtained with timer based on Level',
  'Tokens can also be obtained by Auto Click',
  '',
  '',
  '',
  '',
];
translate = [
  'Eng', 'Kor'
];
toTranslate = [
  'monName', 'lootName', 'weaponName', 'extraStatusTips', 'popupMsg',
  'tokenUpgradeName', 'masteryInfo'
];
