monName = [
  '0',
  'Slime', 'Surprised Slime', 'Angry Slime', 'Happy Slime', 'Expressionless Slime', 'Bat Goblin', 'Warrior Goblin', 'Thrower Goblin', 'Bomb Goblin', 'Ranger Goblin',
  '2-1', '2-2', '2-3', '2-4', '2-5', '2-6', '2-7', '2-8', '2-9', '2-0',
  '3-1', '3-2', '3-3', '3-4', '3-5', '3-6', '3-7', '3-8', '3-9', '3-0',
  '4-1', '4-2', '4-3', '4-4', '4-5', '4-6', '4-7', '4-8', '4-9', '4-0',
  '5-1', '5-2', '5-3', '5-4', '5-5', '5-6', '5-7', '5-8', '5-9', '5-0',
  '6-1', '6-2', '6-3', '6-4', '6-5', '6-6', '6-7', '6-8', '6-9', '6-0',
  '7-1', '7-2', '7-3', '7-4', '7-5', '7-6', '7-7', '7-8', '7-9', '7-0',
  '8-1', '8-2', '8-3', '8-4', '8-5', '8-6', '8-7', '8-8', '8-9', '8-0',
  '9-1', '9-2', '9-3', '9-4', '9-5', '9-6', '9-7', '9-8', '9-9', '9-0',
  '0-1', '0-2', '0-3', '0-4', '0-5', '0-6', '0-7', '0-8', '0-9', '0-0',
];
monNameKor = [
  '0',
  '슬라임', '놀란 슬라임', '화난 슬라임', '행복한 슬라임', '무표정 슬라임', '방망이 고블린', '전사 고블린', '투척 고블린', '폭탄 고블린', '레인저 고블린',
  '선인장', '2-2', '2-3', '2-4', '2-5', '사막 덤불', '2-7', '2-8', '2-9', '2-0',
  '펭귄', '3-2', '3-3', '3-4', '3-5', '흉악한 북극곰', '3-7', '3-8', '3-9', '3-0',
  '꽃', '4-2', '4-3', '4-4', '4-5', '악어', '4-7', '4-8', '4-9', '4-0',
  '스켈레톤', '5-2', '5-3', '5-4', '던전 벽돌', '5-6', '5-7', '5-8', '5-9', '5-0',
  '6-1', '6-2', '6-3', '6-4', '괴생물체 A', '6-6', '6-7', '6-8', '6-9', '6-0',
  '7-1', '7-2', '7-3', '7-4', '7-5', '7-6', '7-7', '7-8', '7-9', '7-0',
  '8-1', '8-2', '8-3', '8-4', '8-5', '8-6', '8-7', '8-8', '8-9', '8-0',
  '9-1', '9-2', '9-3', '9-4', '9-5', '9-6', '9-7', '9-8', '9-9', '9-0',
  '0-1', '0-2', '0-3', '0-4', '0-5', '0-6', '0-7', '0-8', '0-9', '0-0',
];
monNameEng = [
  '0',
  'Slime', 'Surprised Slime', 'Angry Slime', 'Happy Slime', 'Expressionless Slime', 'Bat Goblin', 'Warrior Goblin', 'Thrower Goblin', 'Bomb Goblin', 'Ranger Goblin',
  '2-1', '2-2', '2-3', '2-4', '2-5', '2-6', '2-7', '2-8', '2-9', '2-0',
  '3-1', '3-2', '3-3', '3-4', '3-5', '3-6', '3-7', '3-8', '3-9', '3-0',
  '4-1', '4-2', '4-3', '4-4', '4-5', '4-6', '4-7', '4-8', '4-9', '4-0',
  '5-1', '5-2', '5-3', '5-4', '5-5', '5-6', '5-7', '5-8', '5-9', '5-0',
  '6-1', '6-2', '6-3', '6-4', '6-5', '6-6', '6-7', '6-8', '6-9', '6-0',
  '7-1', '7-2', '7-3', '7-4', '7-5', '7-6', '7-7', '7-8', '7-9', '7-0',
  '8-1', '8-2', '8-3', '8-4', '8-5', '8-6', '8-7', '8-8', '8-9', '8-0',
  '9-1', '9-2', '9-3', '9-4', '9-5', '9-6', '9-7', '9-8', '9-9', '9-0',
  '0-1', '0-2', '0-3', '0-4', '0-5', '0-6', '0-7', '0-8', '0-9', '0-0',
];
lootName = [
  '0',
  'Slime Loot', 'Shiny Slime Loot', 'Goblin Loot', 'Shiny Goblin Loot',
  '2-1', '2-2', '2-3', '2-4',
  '3-1', '3-2', '3-3', '3-4',
  '4-1', '4-2', '4-3', '4-4',
  '5-1', '5-2', '5-3', '5-4',
  '6-1', '6-2', '6-3', '6-4',
  '7-1', '7-2', '7-3', '7-4',
  '8-1', '8-2', '8-3', '8-4',
  '9-1', '9-2', '9-3', '9-4',
  '0-1', '0-2', '0-3', '0-4'
];
lootNameKor = [
  '0',
  '슬라임 가방', '반짝이는 슬라임 가방', '고블린 가방', '반짝이는 고블린 가방',
  '2-1', '2-2', '2-3', '2-4',
  '3-1', '3-2', '3-3', '3-4',
  '4-1', '4-2', '4-3', '4-4',
  '5-1', '5-2', '5-3', '5-4',
  '6-1', '6-2', '6-3', '6-4',
  '7-1', '7-2', '7-3', '7-4',
  '8-1', '8-2', '8-3', '8-4',
  '9-1', '9-2', '9-3', '9-4',
  '0-1', '0-2', '0-3', '0-4'
];
lootNameEng = [
  '0',
  'Slime Loot', 'Shiny Slime Loot', 'Goblin Loot', 'Shiny Goblin Loot',
  '2-1', '2-2', '2-3', '2-4',
  '3-1', '3-2', '3-3', '3-4',
  '4-1', '4-2', '4-3', '4-4',
  '5-1', '5-2', '5-3', '5-4',
  '6-1', '6-2', '6-3', '6-4',
  '7-1', '7-2', '7-3', '7-4',
  '8-1', '8-2', '8-3', '8-4',
  '9-1', '9-2', '9-3', '9-4',
  '0-1', '0-2', '0-3', '0-4'
];
lootQuantity = [
  '0',
  0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
  0, 0, 0, 0,
];
weaponName = [
  '0',
  'Gel sword', 'Gel boomerang', 'Iron sword', 'Spiked bat', 'Emerald Sword',
  '2-1', '2-2', '2-3', '2-4', '2-5',
  '3-1', '3-2', '3-3', '3-4', '3-5',
  '4-1', '4-2', '4-3', '4-4', '4-5',
  '5-1', '5-2', '5-3', '5-4', '5-5',
  '6-1', '6-2', '6-3', '6-4', '6-5',
  '7-1', '7-2', '7-3', '7-4', '7-5',
  '8-1', '8-2', '8-3', '8-4', '8-5',
  '9-1', '9-2', '9-3', '9-4', '9-5',
  '0-1', '0-2', '0-3', '0-4', '0-5'
];
weaponNameKor = [
  '0',
  '젤 검', '젤 부메랑', '철 검', '가시 방망이', '에메랄드 검',
  '2-1', '2-2', '2-3', '2-4', '2-5',
  '3-1', '3-2', '3-3', '3-4', '3-5',
  '4-1', '4-2', '4-3', '4-4', '4-5',
  '5-1', '5-2', '5-3', '5-4', '5-5',
  '6-1', '6-2', '6-3', '6-4', '6-5',
  '7-1', '7-2', '7-3', '7-4', '7-5',
  '8-1', '8-2', '8-3', '8-4', '8-5',
  '9-1', '9-2', '9-3', '9-4', '9-5',
  '0-1', '0-2', '0-3', '0-4', '0-5'
];
weaponNameEng = [
  '0',
  'Gel sword', 'Gel boomerang', 'Iron sword', 'Spiked bat', 'Emerald Sword',
  '2-1', '2-2', '2-3', '2-4', '2-5',
  '3-1', '3-2', '3-3', '3-4', '3-5',
  '4-1', '4-2', '4-3', '4-4', '4-5',
  '5-1', '5-2', '5-3', '5-4', '5-5',
  '6-1', '6-2', '6-3', '6-4', '6-5',
  '7-1', '7-2', '7-3', '7-4', '7-5',
  '8-1', '8-2', '8-3', '8-4', '8-5',
  '9-1', '9-2', '9-3', '9-4', '9-5',
  '0-1', '0-2', '0-3', '0-4', '0-5'
];
weaponLevel = [
  '0',
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
  0, 0, 0, 0, 0,
];
standardNotation = [
  '', 'K', 'M', 'B', 'T', 'Qu', 'Qi', 'Sx', 'Sp', 'O', 'N',
];
standardNotation2 = [
  '', 'U', 'D', 'T', 'Qa', 'Qi', 'Sx', 'Sp', 'Oc', 'No'
];
standardNotation3 = [
  'Dc', 'Vg', 'Tg', 'Qag', 'Qig', 'Sxg', 'Spg', 'Ocg', 'Nog', 'Ce'
];
extraStatusTips = [
  'The maximum level of the weapon is +999!',
  'Rare-grade sword damage is low, but with experience bottle!',
  'Tokens can be earned each time a weapon reaches level 10.!',
  'The amount of experience required is tripled each time the level goes up.!',
  'There are 100 monsters!',
  'Hit / s increases by 1 for every 100 weapon levels!',
  '???'
];
extraStatusTipsKor = [
  '무기의 최대 레벨은 +999 입나다!',
  '희귀등급 검은 대미지는 낮지만 경험치 병이 딸려옵니다!',
  '토큰은 무기가 10레벨이 오를때 마다 얻을수 있습니다!',
  '필요 경험치량은 레벨이 오를때마다 3배씩 증가합니다!',
  '몬스터는 100마리가 있습니다!',
  '무기 레벨 100 마다 Hit/s가 1씩 늘어납니다!',
  '???'
];
extraStatusTipsEng = [
  'The maximum level of the weapon is +999!',
  'Rare-grade sword damage is low, but with experience bottle!',
  'Tokens can be earned each time a weapon reaches level 10.!',
  'The amount of experience required is tripled each time the level goes up.!',
  'There are 100 monsters!',
  'Hit / s increases by 1 for every 100 weapon levels!',
  '???'
];
varData = [
  'playerLevel', 'stageUnlocked', 'playerExp', 'playerExpNeed', 'token',
  'playerHitPS', 'collectedWeapon', 'weaponMastery', 'playerDmg', 'translateNum',
  'weaponLevel', 'lootQuantity', 'tokenUpgrade', 'tokenUpgradePrice', 'tokenUpgrade',
  'tokenUpgradePrice'
];
popupMsg = [
  'Reached max stage!', 'Reach Level', 'to Open'
];
popupMsgKor = [
  '최대 단계 도달!', '', '레벨에 도달하여 해금'
];
popupMsgEng = [
  'Reached max stage!', 'Reach Level', 'to Open'
];
tokenUpgradeName = [
  'Damage Buff', 'Click Buff', 'EXP Buff', 'Monster EXP Buff', 'Token (Click)', 'Token (Timer)'
];
tokenUpgradeNameKor = [
  '공격력 버프', '클릭 버프', '경험치 버프', '몬스터 경험치 버프', '토큰 획득 (클릭)', '토큰 획득 (타이머)'
];
tokenUpgradeNameEng = [
  'Damage Buff', 'Click Buff', 'EXP Buff', 'Monster EXP Buff', 'Token (Click)', 'Token (Timer)'
];
tokenUpgrade = [
  0, 0, 0, 0, 0, 0
];
tokenUpgradePrice = [
  3, 5, 10, 50, 5, 10
];
tokenUpgradeCap = [
  99, 99, 99, 10, 99, 59
];
translate = [
  'Eng', 'Kor'
];
toTranslate = [
  'monName', 'lootName', 'weaponName', 'extraStatusTips', 'popupMsg'
];
